{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Chinh tri Xa hoi",
    "1": "Doi song",
    "2": "Khoa hoc",
    "3": "Kinh doanh",
    "4": "Phap luat",
    "5": "Suc khoe",
    "6": "The gioi",
    "7": "The thao",
    "8": "Van hoa",
    "9": "Vi tinh"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Chinh tri Xa hoi": 0,
    "Doi song": 1,
    "Khoa hoc": 2,
    "Kinh doanh": 3,
    "Phap luat": 4,
    "Suc khoe": 5,
    "The gioi": 6,
    "The thao": 7,
    "Van hoa": 8,
    "Vi tinh": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "5.2.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}